{
    "name": "CircuitBreaker",
    "title": "Circuit Breaker Guide",
    "description": "Build a fault tolerant microservice ...",
    "duration": "10 minutes",
    "audience": "developer",
    "steps": [
        {
            "name": "Intro",
            "title": "Introduction",
            "description": "Building a fault tolerant microservice is important so that it is resilient in the case of failure. If a  microservice fails, then it is important to have a circuit breaker to prevent unsuccessful attempts. If the retry fails, then the microservice should have a fallback solution to execute.",
            "displayType": "none"
        },
        {
            "name": "Scenario",
            "title": "Bank Scenario",
            "description": [
                "Imagine that your bank has many different microservices:",
                "a service for checking your balance, a service for withdrawing money, a service for depositing money, and a cache service to use for backup.<br/>",
                "On the next step, you will try to check your balance on the bank's website.",
                "(pod showing the online banking diagram with different microservices will be inserted below)"
            ],
            "content": [
              {
                "displayType":"pod",
                "display":"Show diagram here."
              }
            ],
            "steps": [
                {
                    "name": "CheckBalance",
                    "title": "Check Balance",
                    "description": [
                      "Visit your bank's website by typing <b>http://localhost:9080/RestServicesSamples/banking/checkBalance</b> into the browser URL and then press <b>Enter</b>.",
                      "(pod sliding in to show the checkBalance microservice is down after url is entered to show checkBalance microservice is down)"
                    ],
                    "content":[
                      {
                        "displayType":"webBrowser",
                        "url": "",
                        "browserContent": "",
                        "callback": "(function test(webBrowser) {circuitBreakerCallBack.listenToBrowserForFailBalance(webBrowser); })"
                      }
                    ]
                }
            ]
        },
        {
            "name": "CircuitBreaker",
            "title": "Circuit Breaker",
            "description": [
                "A circuit breaker allows your microservice to fail immediately when it is down so additional attempts will not have to wait to know that it is down.",
                "A circuit will remain closed and run the microservice until it fails.",
                "When the service fails, the circuit goes into an open state for a set delay period and any attempt to call the service will fail immediately.",
                "After the delay, the circuit switches to a half-opened state. It will allow requests to the main service again and take <successThreshold> successful attempts before the circuit is closed again.",
                "If it fails before then, the circuit goes back into an open state and is down for the set delay.",
                "TODO: add in image of circuit below (pod showing the diagram of 3 circuit breaker states in below)"
              ],
            "steps": [
              {
                  "name": "AfterAddCircuitBreakerAnnotation",
                  "title": "Add Circuit Breaker Annotation",
                  "description": [
                      "Add a circuit breaker annotation to the bank's checkBalance microservice to enable the circuit breaker.",
                      "Type in <pre><b>@CircuitBreaker (successThreshold=4,requestVolumeThreshold=1,failureRatio=1,delay=1000)</b></pre> above the checkBalance method, then click the <b>save button</b> on the upper left of the menu pane.",
                      "(pod sliding in showing checkBalance microservice with circuitBreaker in it after save is clicked)",
                      "The circuit will open when 1 (1 requestVolumeThreshold x1.00 failureRatio) failure occurs among the rolling window of 1 consecutive invocations.",
                      "The circuit will stay open for 1000ms and then transition to half open.",
                      "After 4 consecutive successful invocations, the circuit will be back to close again."
                  ],
                  "content":[
                    {
                      "displayType":"fileEditor",
                      "fileName": "BankService.java",
                      "preload": [
                          "package com.ibm.websphere.restexamples;",
                          "import javax.ws.rs.GET;",
                          "import javax.ws.rs.Path;",
                          "",
                          "public class BankService {",
                          "",
                          "    public Service checkBalance() {",
                          "        counterForInvokingBankingService++;",
                          "        return checkBalanceService();",
                          "    }",
                          "}"
                      ],
                      "readonly": false,
                      "save": true
                    }
                  ]
              },
              {
                  "name": "OpenCircuit",
                  "title": "Open Circuit",
                  "description": [
                      "If a failure occurs, the circuit breaker keeps a record.<br/>",
                      "Click on the <b>refresh button</b> in the browser.<br/>",
                      "Since the checkBalance microservice is still down, a failure is returned. After 1 failure is reached, the circuit is now in open state so any future attempt to connect to the checkBalance service will return immediately without waiting.",
                      "(pod sliding in to show a open circuit after refreshing URL and system is still down.)"
                  ],
                  "content":[
                    {
                      "displayType":"webBrowser",
                      "url": "http://localhost:9080/RestServicesSamples/banking/checkBalance",
                      "browserContent": "Replace with pod container",
                      "callback": "(function test(webBrowser) {circuitBreakerCallBack.listenToBrowserForFailBalance(webBrowser); })"
                    }
                  ]
              }
            ]
        },
        {
            "name": "Fallback",
            "title": "Fallback",
            "description": "A fallback is another microservice that runs when your main service fails. In conjunction with a circuit breaker, a fallback is used for the whole delay while the circuit is in the open state and any requests that come to the main service are diverted to the fallback.",
            "steps": [
              {
                  "name": "AddFallBack",
                  "title": "Add Fallback",
                  "description": [
                    "You will add a fallback service named cachedService that will run whenever the checkBalance service is down and the circuit is in an open state.",
                    "Proceed by adding an annotation to line 6 above the checkBalance service:",
                    "<pre><b>@Fallback (fallbackMethod = \"fallbackService\")</b></pre>Add the following method to the bottom of the class:",
                    "<pre><b>public Service fallbackService() {</b>",
                    "<b>        return cachedService();</b>",
                    "<b>}</b></pre>and then click the <b>save button</b>.",
                    "(pod sliding in to show an open circuit breaker with fallback after save is clicked)"
                  ],
                  "content":[
                    {
                      "displayType":"fileEditor",
                      "fileName": "BankService.java",
                      "preload": [
                          "package com.ibm.websphere.restexamples;",
                          "import javax.ws.rs.GET;",
                          "import javax.ws.rs.Path;",
                          "",
                          "public class BankService {",
                          "",
                          "    @CircuitBreaker (successThreshold=4,requestVolumeThreshold=1,failureRatio=1,delay=1000)\"",
                          "    public Service checkBalance() {",
                          "        counterForInvokingBankingService++;",
                          "        return BankingService();",
                          "    }",
                          "}"
                      ],
                      "readonly": "false",
                      "save": true
                    },
                    {
                      "displayType":"webBrowser",
                      "url": "Replace widget with pod"
                    }
                  ]
              },
              {
                  "name": "cachedService",
                  "title": "Cache Service",
                  "description": [
                    "Click on the <b>refresh button</b> in the browser.<br/>",
                    "Since the circuit is opened, the service will fail right away but the fallback service will be executed. The circuit will become half-open after the delay.",
                    "(pod sliding in to show a half-open circuit breaker with fallback after refresh is returned showing the balance)"
                  ],
                  "content":[
                    {
                      "displayType":"webBrowser",
                      "url": "http://localhost:9080/RestServicesSamples/banking/checkBalance",
                      "callback": "(function test(webBrowser) {circuitBreakerCallBack.listenToBrowserForFallbackSuccessBalance(webBrowser); })"
                    }
                  ]
              }
            ]
        },
        {
            "name": "HalfOpenCloseCircuit",
            "title": "Half-open to Closed Circuit",
            "description": "In a half-open circuit, one call to the circuit is allowed. If it fails, the circuit will remain open. Otherwise, subsequent calls are allowed. After four consecutive successful execution per our circuitBreaker annotation, the circuit will be closed.",
            "steps": [
              {
                  "name": "closeCircuit",
                  "title": "Transition to Closed Circuit",
                  "description": [
                    "Since the circuitBreaker is in half-open state, three consecutive check balance transations have run successfully using the checkBalance microservice.",
                    "<br/>Now click on the <b>refresh button</b> in the browser.<br/>",
                    "The service runs successfully. Since this is the fourth successful calls, the circuit is now closed.",
                    "(pod sliding in to show a closed circuit breaker with fallback after refresh is returned showing the balance)"
                  ],
                  "content":[
                    {
                      "displayType":"webBrowser",
                      "url": "http://localhost:9080/RestServicesSamples/banking/checkBalance",
                      "callback": "(function test(webBrowser) {circuitBreakerCallBack.listenToBrowserForSuccessBalance(webBrowser); })"
                    }
                  ]
              }
            ]
        },
        {
            "name": "playground",
            "title": "Test configuring your own Circuit Breaker",
            "description": [
              "Since you've learned what a circuit breaker and a fallback are, now you can test configuring the parameters in the circuit breaker annotation and watch the circuit get updated live.",
              "Modify the 4 different parameters above the checkBalance service.",
              "Here's a recap of what the parameters mean:",
              "<b>successThreshold</b>: How many requests need to be successful while in half-open state to switch to closed state.",
              "<b>requestVolumeThreshold</b>: The window of requests that can fail before the circuit switches from closed to open.",
              "<b>failureRatio</b>: What percentage of the requestVolumeThreshold requests need to fail before the circuit switches from closed to open state.",
              "<b>delay</b>: How long the circuit stays in the open state before switching to the half-open state.",
              "TODO: Add the circuit pod and the code editor / buttons for letting them make the next request succeed or fail."
            ]
        },
        {
            "name": "WhatNext",
            "title": "What's Next",
            "description": "Congratulations, you have learned how to use a circuit breaker and provide a fallback to make your microservice fault tolerant."
        }
    ]
}
